MocLG/rtw88-rtl8723bs/reg.h
#define REG_BWOPMODE		0x0603
#define BIT_BWOPMODE_20MHZ	BIT(2)
#define REG_TCR			0x0604
#define BIT_PWRMGT_HWDATA_EN	BIT(7)
#define BIT_TCR_UPDATE_TIMIE	BIT(5)
#define BIT_TCR_UPDATE_HGQMD	BIT(4)
#define REG_RCR			0x0608
#define BIT_APP_FCS		BIT(31)
#define BIT_APP_MIC		BIT(30)
#define BIT_APP_ICV		BIT(29)
#define BIT_APP_PHYSTS		BIT(28)
#define BIT_APP_BASSN		BIT(27)
#define BIT_VHT_DACK		BIT(26)
#define BIT_TCPOFLD_EN		BIT(25)
#define BIT_ENMBID		BIT(24)
#define BIT_LSIGEN		BIT(23)
#define BIT_MFBEN		BIT(22)
#define BIT_DISCHKPPDLLEN	BIT(21)
#define BIT_PKTCTL_DLEN		BIT(20)
#define BIT_DISGCLK		BIT(19)
#define BIT_TIM_PARSER_EN	BIT(18)
#define BIT_BC_MD_EN		BIT(17)
#define BIT_UC_MD_EN		BIT(16)
#define BIT_RXSK_PERPKT		BIT(15)
#define BIT_HTC_LOC_CTRL	BIT(14)
#define BIT_RPFM_CAM_ENABLE	BIT(12)
#define BIT_TA_BCN		BIT(11)
#define BIT_RCR_ADF		BIT(11)
#define BIT_DISDECMYPKT		BIT(10)
#define BIT_AICV		BIT(9)
#define BIT_ACRC32		BIT(8)
#define BIT_AMF			BIT(13)
#define BIT_CBSSID_BCN		BIT(7)
#define BIT_CBSSID_DATA		BIT(6)
#define BIT_APWRMGT		BIT(5)
#define BIT_ADD3		BIT(4)
#define BIT_AB			BIT(3)
#define BIT_AM			BIT(2)
#define BIT_APM			BIT(1)
#define BIT_AAP			BIT(0)
#define REG_RX_PKT_LIMIT	0x060C
#define REG_RX_DRVINFO_SZ	0x060F
#define BIT_APP_PHYSTS		BIT(28)
#define REG_MAR			0x0620
#define REG_USTIME_EDCA		0x0638
#define REG_ACKTO_CCK		0x0639
#define REG_MAC_SPEC_SIFS	0x063A
#define REG_RESP_SIFS_CCK	0x063C
#define REG_RESP_SIFS_OFDM	0x063E
#define REG_ACKTO		0x0640
#define REG_EIFS		0x0642
#define REG_NAV_CTRL		0x0650
#define REG_WMAC_TRXPTCL_CTL	0x0668
#define BIT_RFMOD		(BIT(7) | BIT(8))
#define BIT_RFMOD_80M		BIT(8)
#define BIT_RFMOD_40M		BIT(7)
#define REG_WMAC_TRXPTCL_CTL_H	0x066C
#define REG_WKFMCAM_CMD		0x0698
#define BIT_WKFCAM_POLLING_V1	BIT(31)
#define BIT_WKFCAM_CLR_V1	BIT(30)
#define BIT_WKFCAM_WE		BIT(16)
#define BIT_SHIFT_WKFCAM_ADDR_V2	8
#define BIT_MASK_WKFCAM_ADDR_V2		0xff
#define BIT_WKFCAM_ADDR_V2(x)						       \
	(((x) & BIT_MASK_WKFCAM_ADDR_V2) << BIT_SHIFT_WKFCAM_ADDR_V2)
#define REG_WKFMCAM_RWD         0x069C
#define BIT_WKFMCAM_VALID	BIT(31)
#define BIT_WKFMCAM_BC		BIT(26)
#define BIT_WKFMCAM_MC		BIT(25)
#define BIT_WKFMCAM_UC		BIT(24)

#define REG_RXFLTMAP0		0x06A0
#define REG_RXFLTMAP1		0x06A2
#define REG_RXFLTMAP2		0x06A4
#define REG_RXFLTMAP4		0x068A
#define REG_BT_COEX_TABLE0	0x06C0
#define REG_BT_COEX_TABLE1	0x06C4
#define REG_BT_COEX_BRK_TABLE	0x06C8
#define REG_BT_COEX_TABLE_H	0x06CC
#define REG_BT_COEX_TABLE_H1	0x06CD
#define REG_BT_COEX_TABLE_H2	0x06CE
#define REG_BT_COEX_TABLE_H3	0x06CF
#define REG_BBPSF_CTRL		0x06DC

#define REG_BT_COEX_V2		0x0762
#define BIT_GNT_BT_POLARITY	BIT(12)
#define BIT_LTE_COEX_EN		BIT(7)
#define REG_GNT_BT		0x0765
#define BIT_PTA_SW_CTL		GENMASK(4, 3)
#define REG_BT_COEX_ENH_INTR_CTRL	0x76E
#define BIT_R_GRANTALL_WLMASK	BIT(3)
#define BIT_STATIS_BT_EN	BIT(2)
#define REG_BT_ACT_STATISTICS	0x0770
#define REG_BT_ACT_STATISTICS_1	0x0774
#define REG_BT_STAT_CTRL	0x0778
#define REG_BT_TDMA_TIME	0x0790
#define BIT_MASK_SAMPLE_RATE	GENMASK(5, 0)
#define REG_LTR_IDLE_LATENCY	0x0798
#define REG_LTR_ACTIVE_LATENCY	0x079C
#define REG_LTR_CTRL_BASIC	0x07A4
#define REG_WMAC_OPTION_FUNCTION 0x07D0
#define REG_WMAC_OPTION_FUNCTION_1 0x07D4

#define REG_FPGA0_RFMOD		0x0800
#define BIT_CCKEN		BIT(24)
#define BIT_OFDMEN		BIT(25)
#define REG_CCK_RPT_FORMAT	0x0804
#define BIT_CCK_RPT_FORMAT	BIT(16)
#define REG_RXPSEL		0x0808
#define BIT_RX_PSEL_RST		(BIT(28) | BIT(29))
#define REG_TXPSEL		0x080C
#define REG_RX_GAIN_EN		0x081c
#define REG_CCASEL		0x082C
#define REG_PDMFTH		0x0830
#define REG_BWINDICATION	0x0834
#define REG_CCA2ND		0x0838
#define REG_L1PKTH		0x0848
#define REG_CLKTRK		0x0860
#define REG_CSI_MASK_SETTING1	0x0874
#define REG_NBI_SETTING		0x087c
#define BIT_NBI_ENABLE		BIT(13)
#define REG_CSI_FIX_MASK0	0x0880
#define REG_CSI_FIX_MASK1	0x0884
#define REG_CSI_FIX_MASK6	0x0898
#define REG_CSI_FIX_MASK7	0x089c
#define REG_ADCCLK		0x08AC
#define REG_HSSI_READ		0x08B0
#define REG_FPGA0_XCD_RF_PARA	0x08B4
#define REG_RX_MCS_LIMIT	0x08BC
#define REG_ADC160		0x08C4
#define REG_DBGSEL		0x08fc
#define REG_ANTSEL_SW		0x0900
#define REG_DAC_RSTB		0x090c
#define REG_PSD			0x0910
#define BIT_PSD_INI		GENMASK(23, 22)
#define REG_SINGLE_TONE_CONT_TX	0x0914
#define REG_AGC_TABLE		0x0958
#define REG_RFE_CTRL_E		0x0974
#define REG_2ND_CCA_CTRL	0x0976
#define REG_IQK_COM00		0x0978
#define REG_IQK_COM32		0x097c
#define REG_IQK_COM64		0x0980
#define REG_IQK_COM96		0x0984

#define REG_FAS			0x09a4
#define REG_RXSB		0x0a00
#define BIT_RXSB_ANA_DIV	BIT(15)
#define REG_CCK_RX		0x0a04
#define REG_CCK_PD_TH		0x0a0a
#define REG_PRECTRL		0x0a14
#define BIT_DIS_CO_PATHSEL	BIT(7)
#define BIT_IQ_WGT		GENMASK(9, 8)
#define REG_CCA_MF		0x0a20
#define BIT_MBC_WIN		GENMASK(5, 4)
#define REG_CCK0_TX_FILTER1	0x0a20
#define REG_CCK0_TX_FILTER2	0x0a24
#define REG_CCK0_DEBUG_PORT	0x0a28
#define REG_CCK0_FAREPORT	0x0a2c
#define BIT_CCK0_2RX		BIT(18)
#define BIT_CCK0_MRC		BIT(22)
#define REG_FA_CCK		0x0a5c

#define REG_DIS_DPD		0x0a70
#define DIS_DPD_MASK		GENMASK(9, 0)
#define DIS_DPD_RATE6M		BIT(0)
#define DIS_DPD_RATE9M		BIT(1)
#define DIS_DPD_RATEMCS0	BIT(2)
#define DIS_DPD_RATEMCS1	BIT(3)
#define DIS_DPD_RATEMCS8	BIT(4)
#define DIS_DPD_RATEMCS9	BIT(5)
#define DIS_DPD_RATEVHT1SS_MCS0	BIT(6)
#define DIS_DPD_RATEVHT1SS_MCS1	BIT(7)
#define DIS_DPD_RATEVHT2SS_MCS0	BIT(8)
#define DIS_DPD_RATEVHT2SS_MCS1	BIT(9)
#define DIS_DPD_RATEALL		GENMASK(9, 0)

#define REG_CCA			0x0a70
#define BIT_CCA_CO		BIT(7)
#define REG_ANTSEL		0x0a74
#define BIT_ANT_BYCO		BIT(8)
#define REG_CCKTX		0x0a84
#define BIT_CMB_CCA_2R		BIT(28)

#define REG_CNTRST		0x0b58

#define REG_3WIRE_SWA		0x0c00
#define REG_RX_IQC_AB_A		0x0c10
#define REG_RX_IQC_CD_A		0x0c14
#define REG_TXSCALE_A		0x0c1c
#define BB_SWING_MASK		GENMASK(31, 21)
#define REG_TX_AGC_A_CCK_11_CCK_1		0xc20
#define REG_TX_AGC_A_OFDM18_OFDM6		0xc24
#define REG_TX_AGC_A_OFDM54_OFDM24		0xc28
#define REG_TX_AGC_A_MCS3_MCS0			0xc2c
#define REG_TX_AGC_A_MCS7_MCS4			0xc30
#define REG_TX_AGC_A_MCS11_MCS8			0xc34
#define REG_TX_AGC_A_MCS15_MCS12		0xc38
#define REG_TX_AGC_A_NSS1_INDEX3_NSS1_INDEX0	0xc3c
#define REG_TX_AGC_A_NSS1_INDEX7_NSS1_INDEX4	0xc40
#define REG_TX_AGC_A_NSS2_INDEX1_NSS1_INDEX8	0xc44
#define REG_TX_AGC_A_NSS2_INDEX5_NSS2_INDEX2	0xc48
#define REG_TX_AGC_A_NSS2_INDEX9_NSS2_INDEX6	0xc4c
#define REG_RXIGI_A		0x0c50
#define REG_TX_PWR_TRAINING_A	0x0c54
#define REG_CK_MONHA		0x0c5c
#define REG_AFE_PWR1_A		0x0c60
#define REG_AFE_PWR2_A		0x0c64
#define REG_RX_WAIT_CCA_TX_CCK_RFON_A	0x0c68
#define REG_OFDM0_XA_TX_IQ_IMBALANCE	0x0c80
#define REG_OFDM0_A_TX_AFE	0x0c84
#define REG_OFDM0_XB_TX_IQ_IMBALANCE	0x0c88
#define REG_TSSI_TRK_SW		0x0c8c
#define REG_LSSI_WRITE_A	0x0c90
#define REG_PREDISTA		0x0c90
#define REG_TXAGCIDX		0x0c94
#define REG_TX_AGC_A		0x0c94
#define REG_RFE_PINMUX_A	0x0cb0
#define REG_RFE_INV_A		0x0cb4
#define REG_RFE_CTRL8		0x0cb4
#define BIT_MASK_RFE_SEL89	GENMASK(7, 0)
#define PTA_CTRL_PIN		0x66
#define DPDT_CTRL_PIN		0x77
#define RFE_INV_MASK		0x3ff00000
#define REG_RFECTL_A		0x0cb8
#define REG_RFE_INV0		0x0cbc
#define REG_RFE_INV8		0x0cbd
#define BIT_MASK_RFE_INV89	GENMASK(1, 0)
#define REG_RFE_INV16		0x0cbe
#define BIT_RFE_BUF_EN		BIT(3)

#define REG_IQK_DPD_CFG		0x0cc4
#define REG_CFG_PMPD		0x0cc8
#define REG_IQC_Y		0x0ccc
#define REG_IQC_X		0x0cd4
#define REG_INTPO_SETA		0x0ce8

#define REG_IQKA_END		0x0d00
#define REG_PI_READ_A		0x0d04
#define REG_SI_READ_A		0x0d08
#define REG_IQKB_END		0x0d40
#define REG_PI_READ_B		0x0d44
#define REG_SI_READ_B		0x0d48

