MocLG/rtw88-rtl8723bs/reg.h
#define REG_RX_IQC_AB_C		0x1810
#define REG_RX_IQC_CD_C		0x1814
#define REG_TXSCALE_C		0x181c
#define REG_CK_MONHC		0x185c
#define REG_AFE_PWR1_C		0x1860
#define REG_IGN_GNT_BT1	0x1860
#define REG_TX_AGC_C		0x1894
#define REG_RFE_PINMUX_C	0x18b4

#define REG_RFESEL_CTRL	0x1990
#define REG_AGC_TBL		0x1998

#define REG_RX_IQC_AB_D		0x1a10
#define REG_RX_IQC_CD_D		0x1a14
#define REG_TXSCALE_D		0x1a1c
#define REG_CK_MONHD		0x1a5c
#define REG_AFE_PWR1_D		0x1a60
#define REG_TX_AGC_D		0x1a94
#define REG_RFE_PINMUX_D	0x1ab4
#define REG_RFE_INVSEL_D	0x1abc
#define BIT_RFE_SELSW0_D	GENMASK(27, 20)

#define REG_NOMASK_TXBT	0x1ca7
#define REG_ANAPAR	0x1c30
#define BIT_ANAPAR_BTPS	BIT(22)
#define REG_RSTB_SEL	0x1c38
#define BIT_DAC_OFF_ENABLE	BIT(4)
#define BIT_PI_IGNORE_GNT_BT	BIT(3)
#define BIT_NOMASK_TXBT_ENABLE	BIT(3)

#define REG_HRCV_MSG	0x1cf

#define REG_EDCCA_REPORT	0x2d38
#define BIT_EDCCA_FLAG		BIT(24)

#define REG_IGN_GNTBT4	0x4160

#define REG_USB_MOD	0xf008
#define REG_USB3_RXITV	0xf050
#define REG_USB2_PHY_ADR	0xfe40
#define REG_USB2_PHY_DAT	0xfe41
#define REG_USB2_PHY_CMD	0xfe42
#define BIT_USB2_PHY_CMD_TRG	0x81
#define REG_USB_HRPWM	0xfe58
#define REG_USB3_PHY_ADR	0xff0c
#define REG_USB3_PHY_DAT_L	0xff0d
#define REG_USB3_PHY_DAT_H	0xff0e
#define BIT_USB3_PHY_ADR_WR	BIT(7)
#define BIT_USB3_PHY_ADR_RD	BIT(6)
#define BIT_USB3_PHY_ADR_MASK	GENMASK(5, 0)

#define RF_MODE		0x00
#define RF_MODOPT	0x01
#define RF_WLINT	0x01
#define RF_WLSEL	0x02
#define RF_DTXLOK	0x08
#define RF_CFGCH	0x18
#define BIT_BAND	GENMASK(18, 16)
#define RF18_BAND_MASK	(BIT(16) | BIT(9) | BIT(8))
#define RF18_CHANNEL_MASK	(MASKBYTE0)
#define RF18_RFSI_MASK	(BIT(18) | BIT(17))
#define RF_RCK1_V1	0x1c
#define RF_RCK		0x1d
#define RF_MODE_TABLE_ADDR	0x30
#define RF_MODE_TABLE_DATA0	0x31
#define RF_MODE_TABLE_DATA1	0x32
#define RF_LUTWA	0x33
#define RF_LUTWD1	0x3e
#define RF_LUTWD0	0x3f
#define BIT_GAIN_EXT	BIT(12)
#define BIT_DATA_L	GENMASK(11, 0)
#define RF_T_METER	0x42
#define RF_BSPAD	0x54
#define RF_GAINTX	0x56
#define RF_TXMOD	0x58
#define RF_TXATANK	0x64
#define RF_TXA_PREPAD	0x65
#define RF_TRXIQ	0x66
#define RF_RXIQGEN	0x8d
#define RF_RXBB2	0x8f
#define RF_SYN_PFD	0xb0
#define RF_LCK		0xb4
#define RF_XTALX2	0xb8
#define RF_SYN_CTRL	0xbb
#define RF_MALSEL	0xbe
#define RF_SYN_AAC	0xc9
#define RF_AAC_CTRL	0xca
#define RF_FAST_LCK	0xcc
#define RF_RCKD		0xde
#define RF_TXADBG	0xde
#define RF_LUTDBG	0xdf
#define BIT_TXA_TANK	BIT(4)
#define RF_LUTWE2	0xee
#define RF_LUTWE	0xef

#define LTE_COEX_CTRL	0x38
#define LTE_WL_TRX_CTRL	0xa0
#define LTE_BT_TRX_CTRL	0xa4

#endif
